---
kind: type
id: T:Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType

Type of schedule filter.

## Syntax (C#)
```csharp
public enum ScheduleFilterType
```